/*********************************************************************
*                Copyright (C), 2015-2016, Supersonics. Co., Ltd.
*                        阻抗分析仪驱动程序
*
*                          硬件平台: xxx
*                          主 芯 片: STM32F103
*                          项 目 组: xxx
**********************************************************************
*文件名: AD9833.c
*版  本: V1.0.0
*作  者: 
*日  期: 
*说  明:
**********************************************************************
*重要贡献者: 
**********************************************************************
*历      史: 
*1. <修改者>     <修改日期>     <修改说明>

*********************************************************************/

#include "AD9833.h"

/*********************************************************************
* 函数作用：DDS初始化
* 函数参数：无
* 函数返回值：无
* 描述：控制寄存器复位、清零频率寄存器1和2、清零相位寄存器1和2
**********************************************************************/
void AD9833_Init(void)
{
	CS_H;                              /*使能信号线置高   */
	SCL_H;                             /*时钟信号线置高   */
	SDA_L;                             /*数据线拉低       */

	Write_word(0x0100);	               /*复位DDS          */
	Write_word(0x2000);	               /*准备向频率寄存器写入数据   */
	Write_word(0x4000);	               /*频率寄存器0，低位清零   */
	Write_word(0x4000);	               /*频率寄存器0，高位清零   */
	Write_word(0x2000);	               /*准备向频率寄存器写入数据   */
	Write_word(0x8000);	               /*频率寄存器1，低位清零   */
	Write_word(0x8000);                /*频率寄存器1，高位清零   */
	Write_word(0xD000);	               /*相位寄存器0清零   */
	Write_word(0xF000);	               /*相位寄存器1清零   */
	Write_word(0x2000);
}

/**********************************************************************
* 函数作用：DDS写数据操作
* 函数参数：16位数据
* 函数返回值：无
* 描述：控制寄存器复位、清零频率寄存器1和2、清零相位寄存器1和2
***********************************************************************/
void Write_word(u16 DATA)
{
	unsigned char i;
	SCL_H;
	SDA_H;

  CS_H;
	__NOP();
	__NOP();
	__NOP();
	__NOP();
	__NOP();
	__NOP();
	CS_L;
	__NOP();
	__NOP();
	__NOP();
	for (i = 0; i < 16; i++)
	{
		if (DATA & 0x8000)
		{
			SDA_H;
		}
		else
		{
			SDA_L;
		}
		SCL_L;
		__NOP();
		SCL_H;
		DATA = DATA << 1;
	}
	__NOP();
	CS_H;
	SCL_L;
	__NOP();
}

/********************************************************************
* 函数作用：信号生成
* 函数参数：1、频率输出大小；2、输出波形类型（包括方波、正弦波、三角波）
* 函数返回值：无
*********************************************************************/
void ad9833_out(u32 freq_value, u8 type)
{
	u32 FreqReg;
	u16 FreqReg_l, FreqReg_h;

	FreqReg = (float)(freq_value) * 16.777216 + 0.5;

	FreqReg_l = (FreqReg & 0x3fff) | 0x4000;	           /*低字节(频率0) */
	FreqReg_h = ((FreqReg>>14) & 0x3fff) | 0x4000;       /*高字节(频率0) */
  if (type == 0)		                                   /*type=0,输出方波 */
	{
		Write_word(0x2024);
		Write_word(0xC000);
		Write_word(0xF000);
	}
	else if (type == 1)                                   /*type=1,输出三角波 */
	{
		Write_word(0x2002);
		Write_word(0xC000);
		Write_word(0xF000);
	}
	else if (type == 2)                                   /*type=2,输出正弦波 */
	{
		Write_word(0x2000);
		Write_word(0xC000);
		Write_word(0xF000);
	}

	Write_word(FreqReg_l);
	Write_word(FreqReg_h);
}
